============
Comment 1
============

# Example
gap> a:=2;
2

---

(test_file
  (comment)
  (test_case
    (input_line)
    (output_line))
)

============
Comment 2
============

#
gap> a:=2;
2

---

(test_file
  (comment)
  (test_case
    (input_line)
    (output_line))
)

============
Comment 3
============

# Hello
# World
gap> a:=2;
2

---

(test_file
  (comment)
  (comment)
  (test_case
    (input_line)
    (output_line))
)

============
Comment 4
============

# Hello
#
# World
gap> a:=2;
2

---

(test_file
  (comment)
  (comment)
  (comment)
  (test_case
    (input_line)
    (output_line))
)

============
Comment 5
============

# Hello
#
# World
gap> a:=2; Print("# Test\n");
2
# Test

---

(test_file
  (comment)
  (comment)
  (comment)
  (test_case
    (input_line)
    (output_line)
    (output_line))
)

============
Comment 6
============

# Hello
#
# World
gap> a:=2;
2

# Test
# 
gap> "Hello\nWorld";
Hello
World

---

(test_file
  (comment)
  (comment)
  (comment)
  (test_case
    (input_line)
    (output_line))
  (comment)
  (comment)
  (test_case
    (input_line)
    (output_line)
    (output_line))
)

============
Comment 7
============

gap> a:=2;
2

# End of tests

---

(test_file
  (test_case
    (input_line)
    (output_line))
  (comment)
)

============
Comment 8
============

gap> a:=2;
2

# End of tests
#
# Hello

---

(test_file
  (test_case
    (input_line)
    (output_line))
  (comment)
  (comment)
  (comment)
)

============
Comment 9
============

gap> a:=2;
2

# Another test case
gap> 2+2;
4

# End of tests
#
# Hello

---

(test_file
  (test_case
    (input_line)
    (output_line))
  (comment)
  (test_case
    (input_line)
    (output_line))
  (comment)
  (comment)
  (comment)
)

============
Comment 10
============

# Just comments
#
# Thats all

---

(test_file
  (comment)
  (comment)
  (comment)
)

============
Comment 11
============

# Comment then space

gap> a:=2;
2

# Comment then space

gap> a:=2;
2
