=================
Local statement 1
=================

#@local x, y

gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

---

(test_file
  (local_statement
    (gap_expression))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
)

=================
Local statement 2
=================

#@local x, y
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

---

(test_file
  (local_statement
    (gap_expression))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input 
      (test_case_input_line))
    (test_case_output))
)

=================
Local statement 3
=================

# This is a local statement
#@local x, y
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

---

(test_file
  (comment)
  (local_statement
    (gap_expression))
  (test_case
    (comment)
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
)

=================
Local statement 4
=================

# This is a local statement
#@local x, y

gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> x*y;
2

---

(test_file
  (comment)
  (local_statement
    (gap_expression))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (comment)
    (test_case_input
      (test_case_input_line))
    (test_case_output))
)

=================
Local statement 5
=================

# This is a local statement
#@local x, y

gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# This is a local statement
#@local z

# Hello
gap> z:=10;
gap> x*y*z;
20

---

(test_file
  (comment)
  (local_statement
    (gap_expression))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (comment)
  (local_statement
    (gap_expression))
  (test_case
    (comment)
    (test_case_input
      (test_case_input_line))
    (test_case_output))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
)

=================
If statement 1
=================

#@if x = 3
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> 1+1;
2

# World
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (test_case
      (comment)
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (comment)
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (comment)
  )
)

=================
If statement 2
=================

#@if x = 3
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> 1+1;
2
#@else
gap> "ab";
ab
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (test_case
      (comment)
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (comment)
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (else_clause
      (test_case
        (test_case_input
          (test_case_input_line))
        (test_case_output)))
  )
)

=================
If statement 3
=================

#@if x = 3
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> 1+1;
2

# World
#@else
gap> "ab";
ab
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (test_case
      (comment)
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (comment)
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (comment)
    (else_clause
      (test_case
        (test_case_input
          (test_case_input_line))
        (test_case_output)))
  )
)

=================
If statement 4
=================

#@if x = 3
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> 1+1;
2

# World
#@else
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (test_case
      (comment)
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (test_case
      (comment)
      (test_case_input
        (test_case_input_line))
      (test_case_output))
    (comment)
    (else_clause)
  )
)

=================
If statement 5
=================

#@if x = 3
#@else
gap> 2+2;
4
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (else_clause
      (test_case
        (test_case_input
          (test_case_input_line))
        (test_case_output))
    )
  )
)

=================
If statement 6
=================

#@if x = 3
#@else


gap> 2+2;
4
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (else_clause
      (test_case
        (test_case_input
          (test_case_input_line))
        (test_case_output))
    )
  )
)

=================
If statement 7
=================

#@if x = 3
#@else
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (else_clause)
  )
)

=================
Exec statement 1
=================

#@exec x := 3;

gap> x+2;
5

---

(test_file
  (exec_statement
    (gap_expression))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
)

=================
Exec statement 2
=================

#@exec x := 3;
#@exec y := 2;

gap> x+y;
5

---

(test_file
  (exec_statement
    (gap_expression))
  (exec_statement
    (gap_expression))
  (test_case
    (test_case_input
      (test_case_input_line))
    (test_case_output))
)
