=================
Local statement 1
=================

#@local x, y

gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

---

(test_file
  (local_statement
    (gap_expression))
  (test_case
    (input_line))
  (test_case
    (input_line))
  (test_case
    (input_line)
    (output_line))
)

=================
Local statement 2
=================

#@local x, y
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

---

(test_file
  (local_statement
    (gap_expression))
  (test_case
    (input_line))
  (test_case
    (input_line))
  (test_case
    (input_line)
    (output_line))
)

=================
Local statement 3
=================

# This is a local statement
#@local x, y
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

---

(test_file
  (comment)
  (local_statement
    (gap_expression))
  (comment)
  (test_case
    (input_line))
  (test_case
    (input_line))
  (test_case
    (input_line)
    (output_line))
)

=================
Local statement 4
=================

# This is a local statement
#@local x, y

gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> x*y;
2

---

(test_file
  (comment)
  (local_statement
    (gap_expression))
  (test_case
    (input_line))
  (test_case
    (input_line))
  (test_case
    (input_line)
    (output_line))
  (comment)
  (test_case
    (input_line)
    (output_line))
)

=================
Local statement 5
=================

# This is a local statement
#@local x, y

gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# New test case
#@local z
#@local u, v
gap> z:=10;;
gap> x*y*z;
20

---

(test_file
  (comment)
  (local_statement
    (gap_expression))
  (test_case
    (input_line))
  (test_case
    (input_line))
  (test_case
    (input_line)
    (output_line))
  (comment)
  (local_statement
    (gap_expression))
  (local_statement
    (gap_expression))
  (test_case
    (input_line))
  (test_case
    (input_line)
    (output_line))
)

=================
If statement 1
=================

#@if 2+1 = 3
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> 1+1;
2

# World
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (comment)
    (test_case
      (input_line))
    (test_case
      (input_line))
    (test_case
      (input_line)
      (output_line))
    (comment)
    (test_case
      (input_line)
      (output_line))
    (comment))
)

=================
If statement 2
=================

#@if x = 3
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> 1+1;
2
#@else
gap> "ab";
"ab"
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (comment)
    (test_case
      (input_line))
    (test_case
      (input_line))
    (test_case
      (input_line)
      (output_line))
    (comment)
    (test_case
      (input_line)
      (output_line))
    (else_clause
      (test_case
        (input_line)
        (output_line))))
)

=================
If statement 3
=================

#@if x = 3
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> 1+1;
2

# World
#@else
gap> "ab";
ab
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (comment)
    (test_case
      (input_line))
    (test_case
      (input_line))
    (test_case
      (input_line)
      (output_line))
    (comment)
    (test_case
      (input_line)
      (output_line))
    (comment)
    (else_clause
      (test_case
        (input_line)
        (output_line))))
)

=================
If statement 4
=================

#@if x = 3
# Comment
gap> x := 1;;
gap> y := 2;;
gap> x+y;
3

# Hello
gap> 1+1;
2

# World
#@else
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (comment)
    (test_case
      (input_line))
    (test_case
      (input_line))
    (test_case
      (input_line)
      (output_line))
    (comment)
    (test_case
      (input_line)
      (output_line))
    (comment)
    (else_clause))
)

=================
If statement 5
=================

#@if x = 3
#@else
gap> 2+2;
4
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (else_clause
      (test_case
        (input_line)
        (output_line))))
)

=================
If statement 6
=================

#@if x = 3
#@else


gap> 2+2;
4
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (else_clause
      (test_case
        (input_line)
        (output_line))))
)

=================
If statement 7
=================

#@if x = 3
#@else
#@fi

---

(test_file
  (if_statement
    (gap_expression)
    (else_clause)
  )
)

=================
Exec statement 1
=================

#@exec x := 3;

gap> x+2;
5

---

(test_file
  (exec_statement
    (gap_expression))
  (test_case
    (input_line)
    (output_line))
)

=================
Exec statement 2
=================

#@exec x := 3;
#@exec y := 2;

gap> x+y;
5

---

(test_file
  (exec_statement
    (gap_expression))
  (exec_statement
    (gap_expression))
  (test_case
    (input_line)
    (output_line))
)
